# Дано целое число N. Выведите следующее за ним четное число.

num = int(input())

print(num - num % 2 + 2)
