# Выведите 2ᴺ.

exp = int(input())

print(2 ** exp)
